000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. SHAPE-GETY.
000030 ENVIRONMENT DIVISION.
000040 DATA DIVISION.
000050 LINKAGE SECTION.
000060   01  THIS.
000070       COPY "SHAPE-COPY.COB".
000080   77  PARM-Y PIC 9(3).
000090 PROCEDURE DIVISION USING THIS, PARM-Y.
000100     MOVE Y TO PARM-Y
000110     EXIT PROGRAM.
000120 END PROGRAM SHAPE-GETY.