000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. SHAPE-MOVETO.
000030 ENVIRONMENT DIVISION.
000040 DATA DIVISION.
000050 LINKAGE SECTION.
000060   01  THIS.
000070       COPY "SHAPE-COPY.COB".
000080   77  PARM-X PIC 9(3).
000090   77  PARM-Y PIC 9(3).
000100 PROCEDURE DIVISION USING THIS, PARM-X, PARM-Y.
000110     CALL "SHAPE-SETX" USING THIS, PARM-X
000120     CALL "SHAPE-SETY" USING THIS, PARM-Y
000130     EXIT PROGRAM.
000140 END PROGRAM SHAPE-MOVETO.