000001 ID DIVISION. 
000002 PROGRAM-ID. BMSMAPS. 
000003 DATA DIVISION. 
000004 WORKING-STORAGE SECTION. 
000005 01 A. 
000006      05 A1 PIC 9(2). 
000007      05 A2 PIC X(10). 
000008 01 BB PIC 9(2). 
000009 01 CC PIC S9(4) COMP. 
000010 01 FILEMAPI PIC X(1000). 
000011 01 FILEMAPO PIC X(1000). 
000012 		COPY DFHBMSCA.
000013 PROCEDURE DIVISION.  
000014       MOVE 10 TO A1. 
000015       MOVE DFHBMEOF TO F1A. 
000015       MOVE -1 TO F2L. 
000019       EXEC CICS SEND 
000020             MAP('FILEMAP') 
000021             MAPSET('MACSET') 
000022             FROM(FILEMAPO) 
000023             CURSOR 
000023             ERASE 
000024       END-EXEC. 
000025       EXEC CICS RECEIVE 
000026             MAP('FILEMAP') 
000027             MAPSET('MACSET') 
000028             INTO(FILEMAPI) 
000029       END-EXEC.
000053       MOVE F2I TO A2. 
000053       MOVE A1 TO F1O. 
000054       MOVE A2 TO F2O.
000055       EXEC CICS SEND 
000056           MAP('FILEMAP') 
000057           MAPSET('MACSET') 
000058           FROM(FILEMAPI)     <* VIOLAZ
000059           ERASE 
000077        EXEC CICS RETURN 
000078        END-EXEC. 
