000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. CIRCLE-GETRADIUS.
000030 ENVIRONMENT DIVISION.
000040 DATA DIVISION.
000050 LINKAGE SECTION.
000060   01  THIS.
000070       COPY "SHAPE-COPY.COB".
000080       COPY "CIRCLE-COPY.COB".
000090   77  PARM-RADIUS PIC 9(3).
000100 PROCEDURE DIVISION USING THIS, PARM-RADIUS.
000110     MOVE RADIUS TO PARM-RADIUS
000120     EXIT PROGRAM.
000130 END PROGRAM CIRCLE-GETRADIUS.