000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. SHAPE-INIT.
000030 ENVIRONMENT DIVISION.
000040 DATA DIVISION.
000050 LINKAGE SECTION.
000060   01  THIS.
000070       COPY "SHAPE-COPY.COB".
000080   77  PARM-X PIC 9(3).
000090   77  PARM-Y PIC 9(3).
000100 PROCEDURE DIVISION USING THIS, PARM-X, PARM-Y.
000110     CALL "SHAPE-MOVETO" USING THIS, PARM-X, PARM-Y
000120     EXIT PROGRAM.
000130 END PROGRAM SHAPE-INIT.