000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. VSAMSEQ1.
000300* READ VSAM KSDS SEQUENTIALLY
000400* JUST DISPLAY THE VSAM RECORDS
000500* NOTHING COMPLEX IN THIS PROGRAM
000600* THE LOGIC IS THE SAME AS FOR THE SIMPLE FILE READ SEQUENTIALLY
000700 ENVIRONMENT DIVISION.
000800 CONFIGURATION SECTION.
000900 INPUT-OUTPUT SECTION.
001000 FILE-CONTROL.
001100*    INPUT VSAM FILE IS: TSOUSR1.VSAMKSDS.EMPSORTD
001200*    JCL TO CREATE INPUT FILE IS VSAMDEF.JCL
001300*    USES EMPSORTD INPUT TO JCL
001400*    OF COURSE THE NAMES MAY BE DIFFERENT AT YOUR COMPANY
001500     SELECT VSAM-KSDS-FILE ASSIGN VSAMKSDS
001600        ORGANIZATION IS INDEXED
001700        ACCESS MODE IS SEQUENTIAL
001800*    RECORD KEY NOT NEEDED FOR SEQ READING
001900        RECORD KEY IS VSAM-KSDS-RECORD-KEY
002000        FILE STATUS  IS VSAM-STATUS-CODE
002100                        VSAM-EXTENDED-STATUS-CODE.
002200 DATA DIVISION.
002300 FILE SECTION.
002400
002500 FD  VSAM-KSDS-FILE.
002600 01  VSAM-KSDS-RECORD.
002700*    YOU WON'T BE USING THE NEXT FIELD IN THIS PROGRAM
002800*    BECAUSE YOU ARE READING SEQUENTIALLY, NOT RANDOMLY
002900*    THE 20 MEANS THE KEY FIELD HAS A LENGTH OF 20
003000*    REFER  BACK TO THE JCL WHICH CREATES THE VSAM FILE
003100*    BECAUSE THAT IS WHERE THE 20 COMES FROM
003200*    THE RECORD KEY IS ACTUALLY EMPLOYEE NAME IN THIS DATA FILE
003300     05  VSAM-KSDS-RECORD-KEY    PIC X(20).
003400     05  VSAM-KSDS-EMP-INFO      PIC X(60).
003600 WORKING-STORAGE SECTION.
003700 01  VSAM-STATUS-CODE.
003800     05 VSAM-STATUS-CODE-BYTE1   PIC X.
003900     05 VSAM-STATUS-CODE-BYTE2   PIC X.
004000
004100 01  VSAM-EXTENDED-STATUS-CODE.
004200     05 VSAM-EXTENDED-RETURN-CODE   PIC S9(4) COMP.
004300     05 VSAM-EXTENDED-FUNCTION-CODE PIC S9(4) COMP.
004400     05 VSAM-EXTENDED-FEEDBACK-CODE PIC S9(4) COMP.
004500
004600 01  SWITCHES.
004700      05  FILE-AT-END     PIC X  VALUE 'N'.
004800
004900 PROCEDURE DIVISION.
005000     PERFORM INITIALIZATION
005100     PERFORM PROCESS-ALL
005200         UNTIL FILE-AT-END = 'Y'
005300     PERFORM TERMINATION
005400     GOBACK.
005600 INITIALIZATION.
005700     OPEN INPUT VSAM-KSDS-FILE
005800     IF VSAM-STATUS-CODE IS NOT EQUAL TO '00'
005900     THEN GO TO ERROR-EXIT
006000     END-IF
006100     PERFORM READ-PAR.
006300 PROCESS-ALL.
006400*    THIS PROGRAM IS SIMPLE.
006500*    IT JUST DISPLAYS THE RECORDS OF THE VSAM FILE
006600*    OTHER PROGRAMS WOULD DO MORE INVOLVED PROCESSING
006700     DISPLAY VSAM-KSDS-RECORD
006800     PERFORM READ-PAR.
006900
007000 TERMINATION.
007100     CLOSE VSAM-KSDS-FILE.
007300 READ-PAR.
007400     READ VSAM-KSDS-FILE
007500     AT END MOVE 'Y' TO FILE-AT-END
007600     NOT AT END
007700      IF VSAM-STATUS-CODE IS NOT EQUAL TO '00'
007800      THEN GO TO ERROR-EXIT
007900      END-IF
008000     END-READ.
008200 ERROR-EXIT.
008300*   SEE THE PROGRAM VSAMSEQ2 FOR VSAM STATUS CODES
008400*   AND EXTENDED STATUS CODES
008500*   AND THE REMAINDER OF THIS PARAGRAPH