***SET*OGGETTO=ROUTINE
***SET*MODULO=BASE
***SET*MONITOR=NO
***SET*DATABASE=NO
***SET*VERSIONE=SRC
***DOC*TITOLO
      *GOPP - INSERIMENTO ORDINI
***DOC*DESCRIZIONE
      *GOPP - INSERIMENTO ORDINI
***DOC*AGGIORNAMENTI
030200*RILASCIO INIZIALE
180700*DS*I*ALIMENTO ESTERO CON I MOVIMENTI ESEGUITI ONLINE
250800*PV*I*IL PREZZO VIENE VALORIZZATO IN BASE AL TIPO PREZZO SPECIFICATO
250800*     SULLA PIAZZA TRAMITE IL SERVIZIO A1GBRPR
100900*FL*I*AGGIUNTA COPY A0CLNKBE
210900*PV*I*AGGIUNTI CONTROLLI SU PREZZO LIMITE
101000*RB*E*CONTROLLO SE IL PANIERE E' ABILITATO AL CANALE
241000*EL*I*INSERITI CAMPI PER UTILIZZO NUOVA A1CCTIS
181100*FL*I*AGGIUNTA COPY A2LCUC2T
291100*MCU*I*AGGIUNTE COPY A1BANGRB E A1BCCCRB
300101*RILASCIO IN PRODUZIONE
200201*MP*I*AGGIUNTE COPY A0WSTR E A0CSTR
210201*RILASCIO IN PRODUZIONE
010301*MRS*I*AGGIUNTE COPY PER CHIAMATA AD A1GKADP (ASSEGNAZ. DPS)
170401*DP*I*NUOVA GESTIONE RIPARTENZE
310501*GP*I*GESTIONE CAPOFILA UGUALE AD AGENZIA
020601*EV*I*NUOVA GESTIONE AUTORIZZAZIONI PANIERE
180601*DP*I*AGGIUNTI CAMPI PER INESEGUIRE L'ORDINE
100801*RILASCIO IN PRODUZIONE
031201*MS*I*ID16420*AGGIUNTE COPY A1WXVIN E A1CXVIN
280102*RILASCIO IN PRODUZIONE
290102*OM*I*ID16872*DISTINZIONE TRA OPERAZIONI DICHIARATE INADEGUATE
290102*    DALL'OPERATORE E QUELLE CHE RISULTANO INADEGUATE DAI CONTROLLI
050302*MP*I*ID16062*NEWCAL*NUOVA GESTIONE CALENDARI TRAMITE SERVIZI:
050302*     INSERITE E TOLTE COPY
270302*RILASCIO IN PRODUZIONE
271102*AV*E*ID25308*IMPOSTATI GLI ATTRIBUTI PER L'ORDINANTE
130103*RILASCIO IN PRODUZIONE
030303*SIL*I*ID28363*AGGIUNTA GESTIONE EASY2
150703*RILASCIO IN PRODUZIONE
220803*HZ*I*I31630*MULTISERVICE.INSERITE COPY X TABELLA A2TAOSR
230803*HZ*I*I33446*RITARGATE MODIFICHE DELL'ID I31630
291003*TI*I*I35967*AGGIUNTA OPZIONE OPAS - OFFERTA PUBBLICO ACQUISTO
291003*TI*  CON SCAMBIO
101203*PDL*I*I37009*PERFORMANCE A1RBSWIT - RIDUZIONE CHIAMATE IN CALL E
101203*     *SPOSTAMENTO DI ZDINAMIC-CALL DA A1RBSWIT A A1RBSWIC
030504*NG*I*I41086*GESTIONE MODALITA' OPERATIVE IN AMBITO DI CONFLITTO
030504*NG*I*      *DI INTERESSI - MODULO A PAGAMENTO
071004*MF*I*I44852*GESTIONE OPV ENEL III TRANCE
081104*MY*I*I45388*AGGIUNTI NUOVI CAMPI PER RATING DIRECTION
221204*RILASCIO IN PRODUZIONE
221204*FZ*E*I43103*CORRETTA GESTIONE OPS PER GENERANTE OBBLIGAZIONE
280105*RILASCIO IN PRODUZIONE
220305*OM*I*I49812*SPOSTATO WRK-INOMTIT IN A3GWOPPX
130405*RILASCIO IN PRODUZIONE
090505*QD*I*I45265*GESTIONE OPS PER CONCORDATO
140705*MRS*I*I59172*VARIATA ASSEGNAZIONE DEPOSITO DA A1TISRR
140705*     *PER CONTO TERZI (EX I16979)
220905*ZE*I*I54290*AGGIUNTA COPY DI FORMATTAZIONE A1ZPZAR
240306*RILASCIO IN PRODUZIONE
250306*LA*I*I32198*ELIMINATA CHIAMATA STAMPA ORDINE
260306*BG*I*I32247*GESTIONE STAMPA ORDINE. CORRETTA STAMPA FONDI
270606*MF*I*I61879*INSERITE COPY PER MESSAGGI SUL CONFLITTO D'INTERESSE
190407*DP*I*I67816*INSERITE COPY A3ZPSTR A3LPST1T
060707*MP*I*I68957*INSERITE COPY PER MIFID
290807*NI*I*I69018*VALORIZZATO CODICE CONTROPARTE E CND IN CHIAMATA A
290807*     STAMPA PREVENTIVA ORDINE, AGGIUNTO DETTAGLIO COSTI
290907*EM*I*I71707*MIFID - AGGIUNTI CAMPI COMODO PER MULTISERVICE
131107*FZ*E*I71441*CORRETTA PRENOTAZIONE PARTITA AVVISATA PER TITOLI
131107*     CON DIVISA DIVERSA DA EUR
040208*RILASCIO IN PRODUZIONE
060208*BC*I*I75651*ELIMINATA LISTA VALORI PER SINICLI
110308*RILASCIO IN PRODUZIONE
120308*MF*I*I64010*INSERITE COPY A1CCETF/A1WCETF
130308*BC*I*I76303*GESTITA PROTEZIONE CAMPI MIFID X CONSULENZA
030408*RILASCIO IN PRODUZIONE
080708*AC*I*I76008*MODIFICATO ACCESSO FCO/SCC/SCH SE C0 ATTIVATO
121108*DP*I*I75857*AGGIUNTE COPY PER PROBLEMI DI COMPILAZIONE
011208*RILASCIO IN PRODUZIONE
110309*AC*I*A04187*INTERFACCIA CON PROCEDURA DOCUMENTI E CONTRATTI
PI1061*EGI*SALTO TRACCIATURA SE VENGO DA TASK
280911*CP*I*A71282*IMPLEMENTATO CONTROLLO CON TABELLA FILTRI (FLT)
181212*AP*P*TI1468*GESTIONE FILTRO TITOLI VISUALIZZABILI/OPERATIVI
160913*ME*I*B28901*VERIFICA CONFLITTO D'INTERESSE PER OPERAZIONI IN
160913*           *PROMO ZERO FEES
230114*DM*I*239602*INSERITA GESTIONE PROMOZIONI TRAMITE A8TPPOR E TOLTA
230114*           *GESTIONE TRAMITE GSIT
040213*FZ*I*B18382*RIVISTO CALCOLO QTA OPS
200115*FZ*I*B66856*GESTIONE OPS TELEMATICA
180915*FRA*I*TI2889*ESTESA GESTIONE ASSEGNI PER OPV SU TITOLI BP
***DOC*FINE
       IDENTIFICATION DIVISION.
       PROGRAM-ID.  A3GBOPP IS INITIAL.
           COPY A0WAUT.
       DATE-WRITTEN.  03/02/2000.
       DATE-COMPILED.
           COPY A0WREM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           COPY A0WCFG.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
      * +------------------------------------------------------------+
      * + WORKING STORAGE                                            +
      * +------------------------------------------------------------+
       WORKING-STORAGE SECTION.
      * +------------------------------------------------------------+
      * + VARIABILI PRESENTI IN OGNI SERVIZIO                        +
      * +------------------------------------------------------------+
       01  ZPGM                        PIC  X(08)      VALUE 'A3GBOPP'.
       01  ZVER                        PIC  9(04)      VALUE 1.
241000 01  SCOM-I                      PIC  X(01)      VALUE SPACE.
241000 01  SCNP-I                      PIC  X(01)      VALUE SPACE.
I35967 01 WRK-A3SPANR                  PIC X(1000).
I49812*01  WRK-INOMTIT                 PIC S9(12)V9(03) COMP-3.
      * +------------------------------------------------------------+
      * + VARIABILI SPECIFICHE DEL SERVIZIO                          +
      * +------------------------------------------------------------+
      *
      *
       01 ZWRK-SEG                     PIC S9(04) COMP VALUE +1.
       01 ZWRK.
          03 ZWRK-ELE                  PIC X(500) OCCURS 1.
       01 ZWRK-SRV                     REDEFINES ZWRK.
170401*   03 FILLER                    PIC  X(500).
170401    COPY A0WSRVRP.
I68957    03 ZWRK-NREGTER              PIC X(08).
I68957    03 ZWRK-NREGANN              PIC 9(02).
I68957    03 ZWRK-NREGNUM              PIC 9(09).
I68957*                                DATI DA RENDERE PERSISTENTI
I71707    03 ZWRK-NREGTER-ISTCAP       PIC X(08).
I71707    03 ZWRK-NREGANN-ISTCAP       PIC 9(02).
I71707    03 ZWRK-NREGNUM-ISTCAP       PIC 9(09).
I71707    03 ZWRK-CDPSPSF-ISTCAP       PIC X(11).
      *                                DATI DA RENDERE PERSISTENTI
I75651*   03 ZWRK-SINICLI              PIC  X(01).
I75651    03 ZWRK-SINICLI              PIC  X(02).
      * +------------------------------------------------------------+
      * + COPY DI WORKING UTILIZZATE DAL SISTEMA                     +
      * +------------------------------------------------------------+
           COPY A0WSRV2.
           COPY A0GW001.
           COPY A0GW002.
170401     COPY A0GW007.
           COPY A0WCOST.
170401*    COPY A0SAPPR.
170401     COPY A0SSRAR.
           COPY A0WDAT2.
           COPY A0SISTR.
           COPY A0WLNK.
           COPY A0WIOI.
           COPY A0WDAT1.
250800* +- SERVIZI --------------------------------------------------+
250800     COPY A1GWRPR.
250800*    COPY A0WSRV1.
250800     COPY A0WSRV3.
250800     COPY A0WSRV.
      * +------------------------------------------------------------+
      * + AREE PER LINK CON LE ROUTINE DI PROCEDURA - MULTISTITUTO   +
      * +------------------------------------------------------------+
           COPY A1WIOR.
031201     COPY A1WXVIN.
           COPY A1WAPCC.
           COPY A1WCANA.
           COPY A1WCBOL.
           COPY A1WCCND.
           COPY A1WCCPG.
           COPY A1WCCTV.
           COPY A1WCLIN.
           COPY A1WCRAT.
           COPY A1WCRIM.
           COPY A1WCCOR.
           COPY A1WCSAV.
           COPY A1WCSAD.
           COPY A1WSDEP.
           COPY A1WSCAM.
           COPY A1WCPAR.
           COPY A1WCDEP.
           COPY A1WAFSS.
           COPY A1WAPRF.
I71441     COPY A1WCCAM.
           COPY A1WCPRE.
           COPY A1WCTPD.
           COPY A1WPRZM.
           COPY A2WCORD.
           COPY A2WCSAO.
           COPY A2WSORD.
           COPY A2WRSIM.
A71282     COPY A1WMP00.
           COPY A3WCPOP.
180700     COPY A1WAEST.
I44852     COPY A1WENEL.
I45388     COPY A1WTRTNG.
           COPY A0WSIC.
           COPY A0WPRTT.
      * +------------------------------------------------------------+
      * + COPY DI WORKING PER LINK A ROUTINE GENERICHE               +
      * + N.B. REDEFINES DELLA A0WIOI                                +
      * +------------------------------------------------------------+
      *
      * +------------------------------------------------------------+
      * + COPY DI WORKING PER LINK A SOTTO-SERVIZI                   +
      * +------------------------------------------------------------+
TI1468     COPY A8GWTVC.
      *
      * +------------------------------------------------------------+
      * + COPY DI WORKING SPECIFICHE DEL SERVIZIO                    +
      * +------------------------------------------------------------+
           COPY A0WROUN.
200201     COPY A0WSTR.
           COPY A3GWOPP.
           COPY A3GWOPPX.
A71282     COPY A3GWFLT.
010301     COPY A1GWADP.
A04187     COPY A1GWC0O.
NEWCAL     COPY A1GWCAL.
I61879     COPY A1GWCFL.
I41086     COPY A1GWENC.
I61879     COPY A1GWX03.
I69018     COPY A1GWDTC.
020601     COPY A0SAUTR.
I75857     COPY A1GWCCT.
           COPY A0SMSGR.
           COPY A0SDIPR.
           COPY A0SOPRR.
I45265     COPY A1SACOR.
           COPY A1SANAR.
           COPY A1SBOLR.
NEWCAL*    COPY A1SCALR.
           COPY A1SRDER.
           COPY A1SISRR.
           COPY A1SCAMR.
           COPY A1SCAUR.
           COPY A1SCNPR.
           COPY A1SCPDR.
           COPY A1SDCSR.
           COPY A1SDEPR.
           COPY A1SDIFR.
           COPY A1SDIVR.
           COPY A1SENTR.
B66856     COPY A1SNCOR.
           COPY A1SFCOR.
           COPY A1SFORR.
           COPY A1SGRPR.
           COPY A1SISFR.
           COPY A1SNRER.
           COPY A1SMOVR.
           COPY A1SPCRR.
           COPY A1SPRZR.
           COPY A1SRFIR.
           COPY A1SRFPR.
           COPY A1SRIMR.
I61879     COPY A1SRMSR.
           COPY A1SSCHR.
           COPY A1STITR.
TI2889     COPY A8SPAPR.
           COPY A1SSCCR.
           COPY A1STPDR.
I45265     COPY A1IWLTT1.
           COPY A1WAGGI.
           COPY A1WPARR.
           COPY A1WCASE.
I64010     COPY A1WCETF.
PI1061     COPY A8WCCCT.
           COPY A1WCOLR.
           COPY A1WCPRM.
I59172     COPY A1GWSBR.
       01  A1WERR-DATI.
           COPY A1WERR.
           COPY A1WITIT.
           COPY A1WNOMIB.
           COPY A1WRK.
           COPY A1WSRVD.
           COPY A1WSWIT.
           COPY A1WTCAM.
I61879     COPY A1WTCFL.
           COPY A1WTMOD.
           COPY A1WTMSG.
           COPY A1WTVIN.
           COPY A1WADAC.
           COPY A1WSCOM.
           COPY A1WSGAI.
           COPY A3WSINV.
           COPY A2SORDR.
I33446     COPY A2SAOSR.
           COPY A2SLEGR.
           COPY A2WSAUT.
           COPY A2WSSCF.
           COPY A2OORAW.
           COPY A2OSCFW.
           COPY A3SGPAR.
           COPY A3SMIXR.
           COPY A3SPANR.
101000     COPY A3SAPCR.
I67816     COPY A3SPSTR.
           COPY A2SCUCR.
020601     COPY A3WCBLC.
I68957     COPY A1SSCPR.
I68957     COPY A1SLP1R.
I68957     COPY A2SEPIR.
I68957     COPY A2SEPER.
I68957     COPY A2SOMFR.
I68957     COPY A2SRIFR.
I68957     COPY A1SCRTR.
I68957     COPY A2WCMIF.
I68957     COPY A2GWXAD.
I68957     COPY A1GWADG.
B28901     COPY A1GWDEC.
239602     COPY A8SPPOR.
030303* +- EASY2 ----------------------------------------------------+
030303     COPY A1SPZAR.
030303     COPY A1SBLKR.
030303     COPY A1WMREG.
030303     COPY A1GWXDR.
030303     COPY A1GWMEP.
030303     COPY A1MOK1W.
      * +------------------------------------------------------------+
      * + LINKAGE SECTION                                            +
      * +------------------------------------------------------------+
       LINKAGE SECTION.
           COPY A0WSRVL.
      * +------------------------------------------------------------+
      * + PROCEDURE DIVISION                                         +
      * +------------------------------------------------------------+
       PROCEDURE DIVISION
      * +- SERVIZI --------------------------------------------------+
250800     COPY A0CSRVIB.
291100     COPY A1BANGRB.
291100     COPY A1BCCCRB.
250800     COPY A0CSRVPB.
I37009
I37009     PERFORM SALVA-EXT-ZIST.
I37009
250800     COPY A0CSRV.
271102     COPY A0CSRV3.
I37009*    COPY A0CSRV2B.
I37009     COPY A0CSRVRB.
100900     COPY A0CLNKBE.
      * +------------------------------------------------------------+
      * + COPY DI PROCEDURE PRESENTI IN OGNI SERVIZIO                +
      * +------------------------------------------------------------+
           COPY A0CDAT.
           COPY A0CDATB.
           COPY A0CIOID.
           COPY A0CLNKB.
170401*    COPY A0LAPP1T.
170401     COPY A0LSRA1T.
           COPY A0LIST1T.
           COPY A0ZDAT.
           COPY A0ZISTR.
      * +------------------------------------------------------------+
      * + COPY DI PROCEDURE SPECIFICHE DEL SERVIZIO                  +
      * +------------------------------------------------------------+
           COPY A0CSICT.
           COPY A0CPRTB1.
           COPY A0CPRTB2.
           COPY A0CROUN.
200201     COPY A0CSTR.
      **** COPY A0CSCH.
           COPY A3GCOPP.
           COPY A3GCOPPX.
NEWCAL*    COPY A3CCOPP.
A04187     COPY A1GLC0O.
A04187     COPY A1CDOCO.
           COPY A1CADPS.
           COPY A1CAGGI.
           COPY A1CASAD.
           COPY A1CASAV.
           COPY A1CASCE.
           COPY A1CCANA.
           COPY A1CCASE.
           COPY A1CAPCC.
           COPY A1CADAC.
           COPY A1CCBOL.
           COPY A1CCCND.
           COPY A1CCCOR.
           COPY A1CCCPG.
           COPY A1CCCTV.
           COPY A1CCDEP.
I64010     COPY A1CCETF.
           COPY A1CCLIN.
           COPY A1CCOLR.
           COPY A1CCPRE.
           COPY A1CCPRM.
           COPY A1CCRAT.
           COPY A1CCRIM.
           COPY A1CCSAV.
           COPY A1CCDIS.
           COPY A1CCTDE.
           COPY A1CCTIS.
           COPY A1CCTIT.
           COPY A1CERR.
           COPY A1CITIT.
           COPY A1CSDEP.
           COPY A1CSDIP.
           COPY A1CSCAM.
           COPY A1CCPAR.
           COPY A1CCFRZ.
I59172     COPY A1GLSBR.
I61879     COPY A1CTCFL.
           COPY A1CTMOD.
           COPY A1CTMSG.
I45388     COPY A1CTRTNG.
           COPY A1CTVIN.
           COPY A1CSRVD.
031201     COPY A1CXVIN.
           COPY A0LOPR1T.
           COPY A0LDIP1T.
           COPY A0LMSG1T.
I45265     COPY A1LACO1T.
           COPY A1LANA1T.
NEWCAL*    COPY A1LCAL1T.
           COPY A1LCAMBT.
           COPY A1LCAM1T.
           COPY A1LCAU1T.
           COPY A1LCNP1T.
           COPY A1LRDE1T.
           COPY A1LISR1T.
           COPY A1LCPD1T.
           COPY A1LDCS1T.
           COPY A1LDEP1T.
           COPY A1LDEPET.
           COPY A1LDIF1T.
310501     COPY A1LDIFBT.
           COPY A1LDIV1T.
           COPY A1LENT1T.
           COPY A1LFCO1T.
           COPY A1LFCO2T.
           COPY A1LFOR1T.
           COPY A1LISF1T.
           COPY A1LMOV1T.
           COPY A1LNRE1T.
I61879     COPY A1LRMS1T.
I76008     COPY A1LSCC1T.
           COPY A1LSCH1T.
           COPY A1LTIT1T.
TI2889     COPY A8LPAP1T.
I45265     COPY A1ILLTT1.
           COPY A0ZOPRR.
I45265     COPY A1ZACOR.
           COPY A1ZRDER.
           COPY A1ZANAR.
NEWCAL*    COPY A1ZCALR.
           COPY A1ZCAMR.
           COPY A1ZCAUR.
           COPY A1ZCNPR.
           COPY A1ZCPDR.
           COPY A1ZDCSR.
           COPY A1ZDEPR.
           COPY A1ZDIFR.
           COPY A1ZDIVR.
           COPY A1ZENTR.
           COPY A1ZFCOR.
           COPY A1ZFORR.
           COPY A1ZISFR.
           COPY A1ZMOVR.
I54290     COPY A1ZPZAR.
           COPY A1ZNRER.
I61879     COPY A1ZRMSR.
           COPY A1ZSCHR.
           COPY A1ZTITR.
TI2889     COPY A8ZPAPR.
I45265     COPY A1IZLTT1.
           COPY A1CPARR.
           COPY A1ZPRZR.
           COPY A1CFPRZ.
           COPY A1LPRZ1T.
           COPY A2CASAO.
I68957*    COPY A2CINAD.
           COPY A2CASVC.
           COPY A2CCORD.
           COPY A2CCSAO.
I32247*    COPY A2CSORD.
I32247*    COPY A2CSAUT.
I32247*    COPY A2CSSCF.
           COPY A2ZLEGR.
           COPY A2LLEG1T.
           COPY A2LLEG4T.
           COPY A2CSORA.
           COPY A2LORD1T.
           COPY A2LORD3T.
           COPY A2ZORDR.
I33446     COPY A2LAOS1T.
I33446     COPY A2ZAOSR.
           COPY A3CCPOP.
           COPY A3LGPA1T.
           COPY A3LMIX1T.
           COPY A3LPAN1T.
           COPY A3LPAN2T.
101000     COPY A3LAPC1T.
           COPY A2LCUC1T.
181100     COPY A2LCUC2T.
I67816     COPY A3LPST1T.
           COPY A3ZGPAR.
           COPY A3ZMIXR.
           COPY A3ZPANR.
101000     COPY A3ZAPCR.
I67816     COPY A3ZPSTR.
           COPY A2ZCUCR.
           COPY A1ZISRR.
180700     COPY A1CAEST.
           COPY A1CAFSS.
           COPY A1CAPRF.
           COPY A1CCTPD.
           COPY A1CPRZM.
           COPY A1CSCOM.
           COPY A1CSGAI.
I44852     COPY A1CENEL.
           COPY A3CSINV.
           COPY A3CRETE.
250800     COPY A1GLRPR.
010301     COPY A1GLADP.
NEWCAL     COPY A1GLCAL.
A71282     COPY A3GLFLT.
I61879     COPY A1GLCFL.
I41086     COPY A1GLENC.
I61879     COPY A1GLX03.
170401     COPY A0GL007.
I75857     COPY A1GLCCT.
020601     COPY A3CCBLC.
020601     COPY A0LAUT1T.
020601     COPY A0ZAUTR.
I68957     COPY A1LSCP1T.
I68957     COPY A1ZSCPR.
I68957     COPY A1LLP11T.
I68957     COPY A1ZLP1R.
I68957     COPY A1LCRT1T.
I68957     COPY A1ZCRTR.
I68957     COPY A2LEPI1T.
I68957     COPY A2ZEPIR.
I68957     COPY A2LEPE1T.
I68957     COPY A2ZEPER.
I68957     COPY A2LOMF1T.
I68957     COPY A2ZOMFR.
I68957     COPY A2LRIF1T.
I68957     COPY A2ZRIFR.
I68957     COPY A2CCMIF.
I76303     COPY A2CCMIFP.
I68957     COPY A2GLXAD.
I68957     COPY A1GLADG.
I69018     COPY A1GLDTC.
PI1061     COPY A8CCCCTB.
A71282     COPY A1CMP00.
TI1468     COPY A8GLTVC.
B28901     COPY A1GLDEC.
239602     COPY A8ZPPOR.
239602     COPY A8LPPO1T.
030303* +- EASY2 ----------------------------------------------------+
030303     COPY A1LPZA1T.
030303     COPY A1LBLK1T.
030303     COPY A1ZBLKR.
030303     COPY A1GLXDR.
030303     COPY A1GLMEP.
030303     COPY A1CMREG.
I37009     COPY A1CSSWIT.
I71441     COPY A1CCCAM.
B18382     COPY A3COPSQ.
B66856     COPY A1ZNCOR.
B66856     COPY A1LNCO1T.
